app/controllers/admin/plants_controller.rb

UPDATE "plants" SET "name" = ?, "updated_at" = ? WHERE "plants"."id" = ?  [["name", "Floppy Ears"], ["updated_at", "2018-04-16 22:36:27.845777"], ["id", 12]]
---
	def update
		@plant.update(plant_params)

SELECT  "plants".* FROM "plants" WHERE "plants"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
	def set_plant
		@plant = Plant.find(params[:id])