app/views/plants/new.html.erb

SELECT "plants".* FROM "plants"
---
<%= form_tag garden_plants_path, :method => :post do %>
<%= collection_select :plant, :id, Plant.all, :id, :name %>