app/views/gardens/index.html.erb

<% @gardens.each do |garden| %>
<li><%= link_to garden.name, garden_path(garden) %> - <%= garden.garden_plants.count %> Plants Live Here</li>
---
SELECT "garden_plants".* FROM "garden_plants" WHERE "garden_plants"."garden_id" = ?  [["garden_id", 3]]
SELECT "gardens".* FROM "gardens"
SELECT COUNT(*) FROM "garden_plants" WHERE "garden_plants"."garden_id" = ?  [["garden_id", 1]]