app/views/gardens/show.html.erb

SELECT "garden_plants".* FROM "garden_plants" WHERE "garden_plants"."garden_id" = ?  [["garden_id", 1]]
SELECT "plants".* FROM "plants" WHERE "plants"."garden_id" = ?  [["garden_id", 1]]
---
<ul>
<% @garden.garden_plants.each do |gp| %>