app/controllers/gardens_controller.rb

SELECT "gardens".* FROM "gardens"
---
	def index
		@gardens = Garden.all