app/controllers/gardens_controller.rb

INSERT INTO "gardens" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Saratoga"], ["user_id", 1], ["created_at", "2018-04-11 19:38:52.233683"], ["updated_at", "2018-04-11 19:38:52.233683"]]
---
	def create
		if garden_params
			@garden = Garden.new(garden_params)
		else
			@garden = Garden.new(:name => params[:name])
		end

		@garden.user = current_user

		if @garden.save

UPDATE "gardens" SET "name" = ?, "updated_at" = ? WHERE "gardens"."id" = ?  [["name", "Homish"], ["updated_at", "2018-04-11 23:45:50.254847"], ["id", 7]]
---
	def update
		@garden.update(garden_params)

DELETE FROM "garden_plants" WHERE "garden_plants"."id" = ?  [["id", 35]]
DELETE FROM "gardens" WHERE "gardens"."id" = ?  [["id", 10]]
---
	def destroy
		@garden.garden_plants.destroy_all

SELECT  "gardens".* FROM "gardens" WHERE "gardens"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
	def set_garden
		@garden = Garden.find(params[:id])