app/controllers/garden_plants_controller.rb

	def water_plant
		@garden_plant.last_watered = Time.now
		@garden_plant.add_water_count	#adds to times_watered column
		@garden_plant.save
---
UPDATE "garden_plants" SET "last_watered" = ?, "times_watered" = ?, "updated_at" = ? WHERE "garden_plants"."id" = ?  [["last_watered", "2018-04-15 23:02:55.468371"], ["times_watered", 2], ["updated_at", "2018-04-15 23:02:55.472614"], ["id", 1]]

	def destroy
		@garden_plant.destroy
---
DELETE FROM "garden_plants" WHERE "garden_plants"."id" = ?  [["id", 1]]

	def add_garden_plant
		@garden = Garden.find(params[:garden_id])

		unless current_user.id == @garden.user.id
			redirect_to root_path
		end

		@garden.plants << Plant.find(params[:plant][:id])
---
SELECT  "gardens".* FROM "gardens" WHERE "gardens"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "garden_plants" ("garden_id", "plant_id", "last_watered", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["garden_id", 1], ["plant_id", 1], ["last_watered", "2018-04-13 21:55:09.401573"], ["created_at", "2018-04-13 21:55:09.401311"], ["updated_at", "2018-04-13 21:55:09.401311"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "plants".* FROM "plants" INNER JOIN "garden_plants" ON "plants"."id" = "garden_plants"."plant_id" WHERE "garden_plants"."garden_id" = ?  [["garden_id", 3]]

	def set_garden_plant
	  if params[:garden_plant_id]
		@garden_plant = GardenPlant.find(params[:garden_plant_id])
---
SELECT  "garden_plants".* FROM "garden_plants" WHERE (garden_id = #<GardenPlant::ActiveRecord_Associations_CollectionProxy:0x00007fb6ccd08ee8> AND plant_id = 7) ORDER BY "garden_plants"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT  "plants".* FROM "plants" WHERE "plants"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]