app/controllers/plants_controller.rb

	def create
		@plant = Plant.new(plant_params)
		@plant.garden = Garden.find(params[:garden_id])
---
SELECT "gardens".* FROM "gardens" INNER JOIN "garden_plants" ON "gardens"."id" = "garden_plants"."garden_id" WHERE "garden_plants"."plant_id" = ?  [["plant_id", 3]]

	def water_plant
		@plant.last_watered = Time.now
		@plant.save
---
INSERT INTO "plants" ("name", "genus", "species", "water_frequency", "garden_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
UPDATE "plants" SET "updated_at" = ?, "last_watered" = ? WHERE "plants"."id" = ?  [["updated_at", "2018-04-06 20:28:21.914463"], ["last_watered", "2018-04-06 20:28:18.064003"], ["id", 1]]