app/controllers/plants_controller.rb

SELECT  "gardens".* FROM "gardens" WHERE "gardens"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
	def new
		if params[:garden_id]
			@garden = Garden.find(params[:garden_id])

SELECT  "gardens".* FROM "gardens" WHERE "gardens"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "garden_plants" ("garden_id", "plant_id", "last_watered", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["garden_id", 1], ["plant_id", 7], ["last_watered", "2018-04-13 00:27:38.645319"], ["created_at", "2018-04-13 00:27:38.645206"], ["updated_at", "2018-04-13 00:27:38.645206"]]
INSERT INTO "plants" ("name", "genus", "species", "water_frequency", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Frooty Tree"], ["genus", "Frootius"], ["species", "Treeus"], ["water_frequency", 6], ["created_at", "2018-03-30 18:08:21.452503"], ["updated_at", "2018-03-30 18:08:21.452503"]]
SELECT "plants".* FROM "plants" INNER JOIN "garden_plants" ON "plants"."id" = "garden_plants"."plant_id" WHERE "garden_plants"."garden_id" = ?  [["garden_id", 1]]
---
	def create
		if params[:garden_id]#params[:plant_id] &&
			@garden = Garden.find(params[:garden_id])
			@garden.plants << Plant.find(plant_params[:id])

UPDATE "plants" SET "genus" = ?, "species" = ?, "water_frequency" = ?, "updated_at" = ? WHERE "plants"."id" = ?  [["genus", "Yuppimuz"], ["species", "Taxinomicus"], ["water_frequency", 9], ["updated_at", "2018-04-11 23:37:49.250364"], ["id", 21]]
---
	def update
		@plant.update(plant_params)

SELECT  "garden_plants".* FROM "garden_plants" WHERE (garden_id = 1 AND plant_id = 1) ORDER BY "garden_plants"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT  "plants".* FROM "plants" WHERE "plants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
		if params[:garden_id]
			@garden_plant = GardenPlant.where("garden_id = #{params[:garden_id]} AND plant_id = #{params[:id]}").first

SELECT  "gardens".* FROM "gardens" WHERE "gardens"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "garden_plants".* FROM "garden_plants" WHERE (garden_id == @garden.id)
SELECT "plants".* FROM "plants" INNER JOIN "garden_plants" ON "plants"."id" = "garden_plants"."plant_id" WHERE "garden_plants"."garden_id" = ?  [["garden_id", 1]]
SELECT "plants".* FROM "plants"
---
	def index
		# add in logic to mitigate permissions
		if params[:garden_id] # && current_user.gardens.include?(Garden.find(params[:garden_id]))
		  @garden = Garden.find(params[:garden_id])
		  @plants = @garden.plants
		  @garden_plants = GardenPlant.where("garden_id = #{@garden.id}")
	      # binding.pry

	    else
	      @plants = Plant.all

DELETE FROM "garden_plants" WHERE "garden_plants"."id" = ?  [["id", 20]]
DELETE FROM "plants" WHERE "plants"."id" = ?  [["id", 3]]
---
	def destroy
		@garden = @plant.garden
		@plant.destroy

SELECT  "plants".* FROM "plants" WHERE "plants"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
	def set_plant
		@plant = Plant.find(params[:id])